[UI_TREE]
Machine = 하드웨어 설정
POWER= 전원 공급 장치 특성
TOUCH = 풋 페달 설정

[IPG,CO2]
IPG, CO2 = 광섬유, CO2
MPULSE_FREQ = 유지 펄스 주파수(kHz)
MPULSE_RELS = 유지 관리 릴리스 시간(미국)

[IPG]
IPG = 파이버 레이저
MO_DELAY_STEPS = MO 지연(미국)
MODECHG_DELAY= 모드 전환 지연(ms)

[YAG,DP,EP,LD]
WORK_CURRENT_TYPE = 현재 값이 있는 대화 상자를 입력합니다.
WORK_CURRENT_TYPEOption = 레이어 0 전류|설정값
WORK_CURRENT = 작동 전류 설정(A)

[ALL]
SAFE_DOOR = 안전 게이트 보호
SAFE_DOOROption=잘못됨 | 일시 중단 | 중단
MARKEND_SCAN = 끝 검류계 위치 표시
MARKEND_SCANOption=원점 | 왼쪽 상단 | 상단 중앙 위치 | 오른쪽 상단 모서리 | 오른쪽 중앙 | 하단 중앙 | 하단 중앙 | 하단 중앙 | 왼쪽 중앙 | 사용자 지정 위치 | 제자리에 유지
MARKEND_X = 주문을 받아서 만들어지는 경우 X 동등한 (mm)
MARKEND_Y = 주문을 받아서 만들어지는 경우 Y 동등한 (mm)

[SCAN]
PREHEAT_ENABLE = 검류계를 예열해야 하는지 여부
PREHEAT_ENABLEOption=아니오 | 예
PREHEAT_TIME = 최소 예열 시간(분)
USE_LIMIT_JUMPDELAY=점프 지연 활성화 여부
USE_LIMIT_JUMPDELAYOption=아니오 | 예
LIMIT_JUMPLEN= 한계 점프 거리(mm)
LIMIT_JUMPDELAY_MM = mm당 점프 시간(US)

[BitmapPower]
BitmapPower = 회색조 비트맵 표시
AUT_TIME = 감쇠 시간(미국)
AUT_COFF = 이득 계수(0-1)

[Signal]
Signal= 신호 설정
Cycle=효과를 위해 여러 번 트리거
MARK_CNT= 표시 명령이 한 번에 여러 번 표시
DELAY = 트리거 후 지연(ms)
DLY_BETWEEN_MARK = 마킹 사이의 시간 지연(ms)
MARK_END_DELAY = 마킹 완료 후 지연(ms)
MARK_END_PULSE_W = 마킹 종료 신호 길이(ms)
B_MARK_ONCE= 트리거 모드
B_MARK_ONCEOption=레벨 트리거 | 가장자리 트리거
Enable_Loop_Mdt=오프라인 후 순환 마킹
Enable_Loop_MdtOption=사용 안 함|사용
IOSELCOUNT=I/O 선택 문서 신호 수
ENABLE_CARDTOUCH= 낮은 컴퓨터 트리거
ENABLE_CARDTOUCHOption=사용 안 함 | 사용

[UI_FACE]
ExportSysPara = 내보내기 매개 변수...
ImportSysPara = 가져오기 매개변수...
Ok=확인
Cancel = 취소
Apply=적용

;---------------------------------BEGIN: EMCC\HansLaserSet.dll-----------------------------------------
[DIALOG_LASERSET]

0=레이저 하드웨어 매개변수 설정 마법사

1=이전 단계

2=다음

3=장

4=취소

 

[DIALOG_POWER]

0=두 번째 단계:당신의 선택 레이저 하드웨어 구성

1=전류 조정 범위(%)

2=최소 전류(%):

3=최대 전류(A):

4=아날로그 Q 드라이브

5=디지털 Q 드라이브

6=Q 드라이브 유형

7=전력 공급 유형

8=CO2 레이저 전력 크기

9=정상적인 전원 공급 장치

10=빠른 응답의 전원 공급 장치

11=보다 크거나 같은 100W

12=미만 100W

13=을 유지 펄스 설정

14=주파수(KHZ)

15=릴리스시(미국)

16=류(%):

17=최대 듀티 사이클

18=상 현재（%）

19=레이저 하드웨어 설정

20=M 값을 설정

21=M-값:

22=조정 요인:

23=정상

24=너무 크

25=너무 작

 

[DIALOG_MODEL]

0=네 단계:에 따라 원하는대로,당신의 마음에 드는 선택을 제어 모드

1=을 제어하는 새로운 방법,간단한 조작으로,사용자가 설정할 필요가 없습니다 지연이지만,부분에서의 레이저 사용됩니다.

2=전통적인 레이저 제어 모드에서 대부분의 사람들의 습관을 사용,모든 레이저를 사용할 수 있는 이 방법입니다.

3=쉬운드

4=전통적인 모드

5=레이저 제어 모드

6=사각형

7=단 하나 머리 모드

8=듀얼 모드

 

[DIALOG_LaserType]

0=레이저 유형:

1=YAG 레이저

2=DP 레이저

3=UV 레이저

4=CO2 레이저

5=Q 전환된 광섬유 레이저

6=SPI 레이저

7=LD 레이저

8=YLPM(HFM-H)레이저

9=YLP-V2 레이저

10=YLPP 레이저

11=HFM-레이저

12=HFM-P 레이저

13=HFM-R 레이저

14=HFM-레이저 J

15=MOPA 조정가능한 펄스 폭의 레이저

16 = 연속 광섬유 레이저

17 = 초고속 레이저

 

[DIALOG_CONTENT]

0=다섯 번째 단계:축하합니다,당신의 설정을 완료되었습니다,저장하십시오 관련 매개변수

 

[LaserType_Explain]

0=YAG 레이저

1=DP 레이저

2=UV 레이저

3=CO2 레이저

4=Q 전환된 광섬유 레이저

5=SPI 레이저

6=LD 레이저

7=MoPa 섬유 레이저

8=YLP-V2 레이저

9=YLPP 레이저

10=HFM-레이저

11=HFM-P 레이저

12=HFM-레이저 Q

13=HFM-레이저 J

14=기타

 

[Model_Explain]

0=CO2 고 쉬운드

1=CO2 전통적인 모드

2=Q-,일반적인 전력공급+디지털 Q 전통적인 모드

3=Q-,일반적인 전원 공급 장치 아날로그 Q 전통적인 모드

4=Q,빠른 응답,power supply+디지털 Q 전통적인 모드

5=Q,빠른 응답의 전원 공급 장치 아날로그 Q 전통적인 모드

6=Q,정상적인 전원 공급 장치 아날로그 Q 쉬운드

7=Q,빠른 응답,power supply+디지털 Q 쉬운드

8=Q,빠른 응답의 전원 공급 장치 아날로그 Q 쉬운드

9=IPG 드

10=SPI 고 쉬운드

11=SPI 레거시 모드

12=LD 드

13=YLPM(HFM-H)-전통적인 모델

14=YLPM(HFM-H)간단 모드

15=YLP-V2 기존의 모드를

16=YLP-V2 고 쉬운드

17=YLPP 전통적인 모드

18=YLPP 쉬운드

19=HFM-전통적인 모드

20=HFM-하는 간단하고 모드

21=HFM-P-전통적인 모드

22=HFM-P 쉬운드

23=HFM-R 레거시 모드

24=HFM-R 쉬운드

25=HFM-J 전통적인 모드

26=HFM-J 간단 모드

 

[DIALOG_ScanType]

0=단계:세계 검류계 유형

1=집에서 검류계

2=기타 검류계

3=팁:십시오의 올바른 선택은 기계에 해당하는 검류계 유형,집에서 만든 검류계 after power-on warm-up 가 제대로 작동하기 위해서는,기타 검류계없이 예열

;---------------------------------End: EMCC\HansLaserSet.dll-----------------------------------------


;---------------------------------BEGIN: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

[PORTDIALOGTEXT]
STATIC_0 = 입력 포트 가공 중지
STATIC_1 = 출력 포트 가공 중지
STATIC_2 = 출력 포트
STATIC_3 = 안전 게이트
STATIC_4 = 입력 포트
STATIC_5 = 레이저가 출력 준비가 되었습니다.
STATIC_6 = 입력 포트
STATIC_7 = 출력 포트
STATIC_8 = 소프트웨어 준비 출력
STATIC_9 = 출력 포트
STATIC_10 = 레이저 출력
STATIC_11 = 포트
STATIC_12 = 외부 빨간불 표시 출력
STATIC_13 = 출력 포트
STATIC_14 = 입력 포트
STATIC_15 = 표시된 반주
STATIC_16 = 출력 포트
STATIC_17 = 마킹 출력 끝
STATIC_18 = 출력 포트
STATIC_19 = 펄스 폭
STATIC_20 = 파이버 레이저 경보 출력
STATIC_21 = 출력 포트
STATIC_22 = 포트 표시 시작
STATIC_23 = 입력 포트
IDC_CHECK_LASERWARN = 감지 레이저 경보
IDC_CHECK_PLUSE_REVERSE = Q 신호 레벨 반전
IDC_RADIO_NORMAL = 표준
IDC_RADIO_BICOLORLAMP = 2색 조명
IDC_RADIO_TRICOLORLIGHT = 삼색 조명

[error]
1 = 카드가 초기화되지 않았거나 카드를 찾을 수 없습니다!
2 = 재설정 실패!
3 = 카드 버전이 잘못되었습니다!
4 = 경찰에 신고!
6 = 실행 실패!
7 = 상태가 맞지 않습니다!
16 = 명령 시간 초과!
17 = 명령 손실!
18 = 인터페이스 호출 비동기화!
19 = 인터페이스가 다른 프로그램에 의해 점용됩니다!
20 = Z축 제한 초과 또는 파일 손상 보정!
21 = 매개 변수가 일치하지 않습니다!
23 = 메모리 할당 실패!
100 = 오프라인 사용 중!
101 = 명령이 중지되었습니다!
1001 = 포트 1
1002 = 포트 2
1003 = 포트 3
1004 = 포트 4
1005 = 포트 5
1006 = 포트 6
1007 = 포트 7
1008 = 레이저 입력이 준비되지 않음
1009 = 레이저 입력 준비

;---------------------------------END: EMCC\HansLaserSet.dll\PortSetDlg-----------------------------------------

;---------------------------------BEGIN: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------
[TITLESTRING]
IDD_LASERSET_DIALOG= 레이저 설정
IDD_PROPPAGE_POWER= 전원 공급 장치 특성
IDD_PROPPAGE_SYS_SET=하드웨어 설정
IDD_PROPPAGE_TOUCH= 페달 설정
IDD_PORT_SET = 포트 설정

[IDD_DIALOG_HANSLASERSET]
CAPTION = 시스템 설정
IDC_BTN_SAVE= 저장
IDCANCEL= 종료
LISTTITLE_NAME= 항목 이름
LISTTITLE_VALUE= 값

;---------------------------------END: EMCC\HansLaserSet.dll\HansLaserSetDlg-----------------------------------------

